# SQL

In [6]:
import sqlite3

In [7]:
con=sqlite3.connect("mysql.db")

In [8]:
cursor=con.cursor()

In [9]:
cursor.execute("""
   CREATE TABLE student1(
   st_id INTEGER,
   st_name TEXT,
   st_marks DECIMAL,
   st_subjects TEXT
   )
   """)

OperationalError: table student1 already exists

In [10]:
cursor.execute("select name from sqlite_master where type='table'; ")

In [11]:
cursor.fetchall()

[('student1',)]

In [12]:
stud_data=[(1, "sun", 23, "chem"), (3, "Moon", 34, "math"), (5, "Luke", 43, "zeo")]
stud_data

[(1, 'sun', 23, 'chem'), (3, 'Moon', 34, 'math'), (5, 'Luke', 43, 'zeo')]

In [13]:
cursor.executemany("INSERT INTO student1 (st_id, st_name, st_marks, st_subjects) VALUES(?,?,?,?)", stud_data)

In [14]:
cursor.execute("select * from student1 where st_marks >40")

In [15]:
cursor.fetchall()

[(5, 'Luke', 43, 'zeo')]

In [16]:
cursor.execute("select COUNT(*), AVG(st_marks) from student1").fetchone()

(3, 33.333333333333336)

In [17]:
cursor.execute("UPDATE student1 set st_name='Sunny' where st_id=1")

In [18]:
stud_data

[(1, 'sun', 23, 'chem'), (3, 'Moon', 34, 'math'), (5, 'Luke', 43, 'zeo')]

In [19]:
cursor.execute("UPDATE student1 set st_name='Sunny' where st_id= 1")

In [20]:
stud_data

[(1, 'sun', 23, 'chem'), (3, 'Moon', 34, 'math'), (5, 'Luke', 43, 'zeo')]

In [21]:
cursor.execute("UPDATE student1 set st_name='Sunny' where st_id= 3")

In [22]:
cursor.fetchall()

[]

In [23]:
cursor.execute("select * from student1").fetchall()

[(1, 'Sunny', 23, 'chem'), (3, 'Sunny', 34, 'math'), (5, 'Luke', 43, 'zeo')]